Revit 2027 API
CoreType Enumeration
 An enumerated type to list all core types.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CoreType
Public Enumeration CoreType
public enum class CoreType
type CoreType
Members
Member name | Value | Description
MultiCore | 1 |  Core type is multi core.
SingleCore | 0 |  Core type is single core.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace